# 2380. 二进制字符串重新安排顺序需要的时间
# 给你一个二进制字符串 s 。在一秒之中，所有 子字符串 "01" 同时 被替换成 "10" 。这个过程持续进行到没有 "01" 存在。
#
# 请你返回完成这个过程所需要的秒数。
#
#
#
# 示例 1：
#
# 输入：s = "0110101"
# 输出：4
# 解释：
# 一秒后，s 变成 "1011010" 。
# 再过 1 秒后，s 变成 "1101100" 。
# 第三秒过后，s 变成 "1110100" 。
# 第四秒后，s 变成 "1111000" 。
# 此时没有 "01" 存在，整个过程花费 4 秒。
# 所以我们返回 4 。
# 示例 2：
#
# 输入：s = "11100"
# 输出：0
# 解释：
# s 中没有 "01" 存在，整个过程花费 0 秒。
# 所以我们返回 0 。
#
#
# 提示：
#
# 1 <= s.length <= 1000
# s[i] 要么是 '0' ，要么是 '1' 。
class Solution:
    def secondsToRemoveOccurrences(self, s: str) -> int:
        # 递归： 时间复杂度O(n ^ 2 ); 空间复杂度O(n)取决于树的深度
        # if '01' not in s:
        #     return 0
        # return self.secondsToRemoveOccurrences(s.replace('01', '10')) + 1

        # 一次遍历：把变换当做将1依次左移，如果'11'左边没有0不需要移动，'011'和'0101'这种情况右边的1移动到最终位置要比左边的1多移动一次； 时间复杂度O(n)；空间复杂度O(1);
        cnt = 0 # 前面所有0的个数
        res = 0
        for c in s:
            if c == '0':
                cnt += 1
            elif cnt:  # 遇到1时，前面有0才需要移动
                res = max(res + 1,
                          cnt)  # res + 1: 如果两个1是 '011' 或者 '0101'这样挨着的情况下，后一个1要比前一个1多移动一次; cnt: 是'010001'的时候只用看前面所有0的个数即可
        return res
